Ac6Embedded/svd-microchip/PIC32CM_GV/PIC32CM1602GV00048.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>SERCOM0</name>
         <version>U22011.1.0</version>
         <description>Serial Communication Interface</description>
         <groupName>SERCOM</groupName>
         <prependToName>SERCOM_</prependToName>
         <baseAddress>0x42000800</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x1A</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>SERCOM0</name>
            <description>Serial Communication Interface 0</description>
            <value>7</value>
         </interrupt>
         <registers>
            <cluster>
               <name>I2CM</name>
               <description>I2C Master Mode</description>
               <headerStructName>SercomI2cm</headerStructName>
               <addressOffset>0x0</addressOffset>
               <register>
                  <name>CTRLA</name>
                  <description>I2CM Control A</description>
                  <addressOffset>0x0</addressOffset>
                  <fields>
                     <field>
                        <name>SWRST</name>
                        <description>Software Reset</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>ENABLE</name>
                        <description>Enable</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>MODE</name>
                        <description>Operating Mode</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>3</bitWidth>
                        <writeConstraint>
                           <useEnumeratedValues>true</useEnumeratedValues>
                        </writeConstraint>
                        <enumeratedValues>
                           <name>MODESelect</name>
                           <enumeratedValue>
                              <name>USART_EXT_CLK</name>
                              <description>USART with external clock</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>USART_INT_CLK</name>
                              <description>USART with internal clock</description>
                              <value>0x1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>SPI_SLAVE</name>
                              <description>SPI in slave operation</description>
                              <value>0x2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>SPI_MASTER</name>
                              <description>SPI in master operation</description>
                              <value>0x3</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>I2C_SLAVE</name>
                              <description>I2C slave operation</description>
                              <value>0x4</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>I2C_MASTER</name>
                              <description>I2C master operation</description>
                              <value>0x5</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>RUNSTDBY</name>
                        <description>Run in Standby</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>PINOUT</name>
                        <description>Pin Usage</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>SDAHOLD</name>
                        <description>SDA Hold Time</description>
                        <bitOffset>20</bitOffset>
                        <bitWidth>2</bitWidth>
                        <writeConstraint>
                           <useEnumeratedValues>true</useEnumeratedValues>
                        </writeConstraint>
                        <enumeratedValues>
                           <name>SDAHOLDSelect</name>
                           <enumeratedValue>
                              <name>DISABLE</name>
                              <description>Disabled</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>75NS</name>
                              <description>50-100ns hold time</description>
                              <value>0x1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>450NS</name>
                              <description>300-600ns hold time</description>
                              <value>0x2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>600NS</name>
                              <description>400-800ns hold time</description>
                              <value>0x3</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>INACTOUT</name>
                        <description>Inactive Time-out</description>
                        <bitOffset>28</bitOffset>
                        <bitWidth>2</bitWidth>
                        <writeConstraint>
                           <useEnumeratedValues>true</useEnumeratedValues>
                        </writeConstraint>
                        <enumeratedValues>
                           <name>INACTOUTSelect</name>
                           <enumeratedValue>
                              <name>DISABLE</name>
                              <description>Disabled</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>55US</name>
                              <description>5-6 SCL Time-Out(50-60us)</description>
                              <value>0x1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>105US</name>
                              <description>10-11 SCL Time-Out(100-110us)</description>
                              <value>0x2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>205US</name>
                              <description>20-21 SCL Time-Out(200-210us)</description>
                              <value>0x3</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>LOWTOUT</name>
                        <description>SCL Low Time-out</description>
                        <bitOffset>30</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>CTRLB</name>
                  <description>I2CM Control B</description>
                  <addressOffset>0x4</addressOffset>
                  <fields>
                     <field>
                        <name>SMEN</name>
                        <description>Smart Mode Enable</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>QCEN</name>
                        <description>Quick Command Enable</description>
                        <bitOffset>9</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>CMD</name>
                        <description>Command</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>2</bitWidth>
                     </field>
                     <field>
                        <name>ACKACT</name>
                        <description>Acknowledge Action</description>
                        <bitOffset>18</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>DBGCTRL</name>
                  <description>I2CM Debug Control</description>
                  <addressOffset>0x8</addressOffset>
                  <size>8</size>
                  <fields>
                     <field>
                        <name>DBGSTOP</name>
                        <description>Debug Stop Mode</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>BAUD</name>
                  <description>I2CM Baud Rate</description>
                  <addressOffset>0xA</addressOffset>
                  <size>16</size>
                  <fields>
                     <field>
                        <name>BAUD</name>
                        <description>Master Baud Rate</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>8</bitWidth>
                     </field>
                     <field>
                        <name>BAUDLOW</name>
                        <description>Master Baud Rate Low</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>8</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>INTENCLR</name>
                  <description>I2CM Interrupt Enable Clear</description>
                  <addressOffset>0xC</addressOffset>
                  <size>8</size>
                  <modifiedWriteValues>oneToClear</modifiedWriteValues>
                  <fields>
                     <field>
                        <name>MB</name>
                        <description>Master on Bus Interrupt Enable</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>SB</name>
                        <description>Slave on Bus Interrupt Enable</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>INTENSET</name>
                  <description>I2CM Interrupt Enable Set</description>
                  <addressOffset>0xD</addressOffset>
                  <size>8</size>
                  <modifiedWriteValues>oneToSet</modifiedWriteValues>
                  <fields>
                     <field>
                        <name>MB</name>
                        <description>Master on Bus Interrupt Enable</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>SB</name>
                        <description>Slave on Bus Interrupt Enable</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>INTFLAG</name>
                  <description>I2CM Interrupt Flag Status and Clear</description>
                  <addressOffset>0xE</addressOffset>
                  <size>8</size>
                  <modifiedWriteValues>oneToClear</modifiedWriteValues>
                  <fields>
                     <field>
                        <name>MB</name>
                        <description>Master on Bus</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>SB</name>
                        <description>Slave on Bus</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>STATUS</name>
                  <description>I2CM Status</description>
                  <addressOffset>0x10</addressOffset>
                  <size>16</size>
                  <fields>
                     <field>
                        <name>BUSERR</name>
                        <description>Bus Error</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>ARBLOST</name>
                        <description>Arbitration Lost</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>RXNACK</name>
                        <description>Received Not Acknowledge</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>BUSSTATE</name>
                        <description>Bus State</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>2</bitWidth>
                     </field>
                     <field>
                        <name>LOWTOUT</name>
                        <description>SCL Low Time-out</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>CLKHOLD</name>
                        <description>Clock Hold</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>SYNCBUSY</name>
                        <description>Synchronization Busy</description>
                        <bitOffset>15</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>ADDR</name>
                  <description>I2CM Address</description>
                  <addressOffset>0x14</addressOffset>
                  <size>8</size>
                  <fields>
                     <field>
                        <name>ADDR</name>
                        <description>Address</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>8</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>DATA</name>
                  <description>I2CM Data</description>
                  <addressOffset>0x18</addressOffset>
                  <size>8</size>
                  <fields>
                     <field>
                        <name>DATA</name>
                        <description>Data</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>8</bitWidth>
                     </field>
                  </fields>
               </register>
            </cluster>
            <cluster>
               <name>I2CS</name>
               <description>I2C Slave Mode</description>
               <alternateCluster>I2CM</alternateCluster>
               <headerStructName>SercomI2cs</headerStructName>
               <addressOffset>0x0</addressOffset>
               <register>
                  <name>CTRLA</name>
                  <description>I2CS Control A</description>
                  <addressOffset>0x0</addressOffset>
                  <fields>
                     <field>
                        <name>SWRST</name>
                        <description>Software Reset</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>ENABLE</name>
                        <description>Enable</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>MODE</name>
                        <description>Operating Mode</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>3</bitWidth>
                        <writeConstraint>
                           <useEnumeratedValues>true</useEnumeratedValues>
                        </writeConstraint>
                        <enumeratedValues>
                           <name>MODESelect</name>
                           <enumeratedValue>
                              <name>USART_EXT_CLK</name>
                              <description>USART with external clock</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>USART_INT_CLK</name>
                              <description>USART with internal clock</description>
                              <value>0x1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>SPI_SLAVE</name>
                              <description>SPI in slave operation</description>
                              <value>0x2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>SPI_MASTER</name>
                              <description>SPI in master operation</description>
                              <value>0x3</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>I2C_SLAVE</name>
                              <description>I2C slave operation</description>
                              <value>0x4</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>I2C_MASTER</name>
                              <description>I2C master operation</description>
                              <value>0x5</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>RUNSTDBY</name>
                        <description>Run in Standby</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>PINOUT</name>
                        <description>Pin Usage</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>SDAHOLD</name>
                        <description>SDA Hold Time</description>
                        <bitOffset>20</bitOffset>
                        <bitWidth>2</bitWidth>
                        <writeConstraint>
                           <useEnumeratedValues>true</useEnumeratedValues>
                        </writeConstraint>
                        <enumeratedValues>
                           <name>SDAHOLDSelect</name>
                           <enumeratedValue>
                              <name>DISABLE</name>
                              <description>Disabled</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>75NS</name>
                              <description>50-100ns hold time</description>
                              <value>0x1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>450NS</name>
                              <description>300-600ns hold time</description>
                              <value>0x2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>600NS</name>
                              <description>400-800ns hold time</description>
                              <value>0x3</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>LOWTOUT</name>
                        <description>SCL Low Time-out</description>
                        <bitOffset>30</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>CTRLB</name>
                  <description>I2CS Control B</description>
                  <addressOffset>0x4</addressOffset>
                  <fields>
                     <field>
                        <name>SMEN</name>
                        <description>Smart Mode Enable</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>AMODE</name>
                        <description>Address Mode</description>
                        <bitOffset>14</bitOffset>
                        <bitWidth>2</bitWidth>
                     </field>
                     <field>
                        <name>CMD</name>
                        <description>Command</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>2</bitWidth>
                     </field>
                     <field>
                        <name>ACKACT</name>
                        <description>Acknowledge Action</description>
                        <bitOffset>18</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
