Ac6Embedded/svd-microchip/PIC32CM_GV/PIC32CM1602GV00048.svd
               <register>
                  <name>INTENSET</name>
                  <description>USART_INT Interrupt Enable Set</description>
                  <addressOffset>0xD</addressOffset>
                  <size>8</size>
                  <modifiedWriteValues>oneToSet</modifiedWriteValues>
                  <fields>
                     <field>
                        <name>DRE</name>
                        <description>Data Register Empty Interrupt Enable</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>TXC</name>
                        <description>Transmit Complete Interrupt Enable</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>RXC</name>
                        <description>Receive Complete Interrupt Enable</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>RXS</name>
                        <description>Receive Start Interrupt Enable</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>INTFLAG</name>
                  <description>USART_INT Interrupt Flag Status and Clear</description>
                  <addressOffset>0xE</addressOffset>
                  <size>8</size>
                  <modifiedWriteValues>oneToClear</modifiedWriteValues>
                  <fields>
                     <field>
                        <name>DRE</name>
                        <description>Data Register Empty</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>TXC</name>
                        <description>Transmit Complete</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>RXC</name>
                        <description>Receive Complete</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>RXS</name>
                        <description>Receive Start Interrupt</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>STATUS</name>
                  <description>USART_INT Status</description>
                  <addressOffset>0x10</addressOffset>
                  <size>16</size>
                  <fields>
                     <field>
                        <name>PERR</name>
                        <description>Parity Error</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>FERR</name>
                        <description>Frame Error</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>BUFOVF</name>
                        <description>Buffer Overflow</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>SYNCBUSY</name>
                        <description>Synchronization Busy</description>
                        <bitOffset>15</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>DATA</name>
                  <description>USART_INT Data</description>
                  <addressOffset>0x18</addressOffset>
                  <size>16</size>
                  <fields>
                     <field>
                        <name>DATA</name>
                        <description>Data</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>9</bitWidth>
                     </field>
                  </fields>
               </register>
            </cluster>
         </registers>
      </peripheral>
      <peripheral derivedFrom="SERCOM0">
         <name>SERCOM1</name>
         <baseAddress>0x42000C00</baseAddress>
         <interrupt>
            <name>SERCOM1</name>
            <description>Serial Communication Interface 1</description>
            <value>8</value>
         </interrupt>
      </peripheral>
      <peripheral derivedFrom="SERCOM0">
         <name>SERCOM2</name>
         <baseAddress>0x42001000</baseAddress>
         <interrupt>
            <name>SERCOM2</name>
            <description>Serial Communication Interface 2</description>
            <value>9</value>
         </interrupt>
      </peripheral>
      <peripheral derivedFrom="SERCOM0">
         <name>SERCOM3</name>
         <baseAddress>0x42001400</baseAddress>
         <interrupt>
            <name>SERCOM3</name>
            <description>Serial Communication Interface 3</description>
            <value>10</value>
         </interrupt>
      </peripheral>
      <peripheral derivedFrom="SERCOM0">
         <name>SERCOM4</name>
         <baseAddress>0x42001800</baseAddress>
         <interrupt>
            <name>SERCOM4</name>
            <description>Serial Communication Interface 4</description>
            <value>11</value>
         </interrupt>
      </peripheral>
      <peripheral derivedFrom="SERCOM0">
         <name>SERCOM5</name>
         <baseAddress>0x42001C00</baseAddress>
         <interrupt>
            <name>SERCOM5</name>
            <description>Serial Communication Interface 5</description>
            <value>12</value>
         </interrupt>
      </peripheral>
      <peripheral>
         <name>SYSCTRL</name>
         <version>U21002.0.1</version>
         <description>System Control</description>
         <baseAddress>0x40000800</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x44</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>SYSCTRL</name>
            <description>System Controller</description>
            <value>1</value>
         </interrupt>
         <registers>
            <register>
               <name>INTENCLR</name>
               <description>Interrupt Enable Clear</description>
               <addressOffset>0x0</addressOffset>
               <modifiedWriteValues>oneToClear</modifiedWriteValues>
               <fields>
                  <field>
                     <name>XOSCRDY</name>
                     <description>XOSC Ready</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>XOSC32KRDY</name>
                     <description>XOSC32K Ready</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OSC32KRDY</name>
                     <description>OSC32K Ready</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OSC8MRDY</name>
                     <description>OSC8M Ready</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DFLLRDY</name>
                     <description>DFLL Ready</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DFLLOOB</name>
                     <description>DFLL Out Of Bounds</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DFLLLCKF</name>
                     <description>DFLL Lock Fine</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DFLLLCKC</name>
                     <description>DFLL Lock Coarse</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DFLLRCS</name>
                     <description>DFLL Reference Clock Stopped</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BOD33RDY</name>
                     <description>BOD33 Ready</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BOD33DET</name>
                     <description>BOD33 Detection</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>B33SRDY</name>
                     <description>BOD33 Synchronization Ready</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>INTENSET</name>
               <description>Interrupt Enable Set</description>
               <addressOffset>0x4</addressOffset>
               <modifiedWriteValues>oneToSet</modifiedWriteValues>
               <fields>
                  <field>
                     <name>XOSCRDY</name>
                     <description>XOSC Ready</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>XOSC32KRDY</name>
                     <description>XOSC32K Ready</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OSC32KRDY</name>
                     <description>OSC32K Ready</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OSC8MRDY</name>
                     <description>OSC8M Ready</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DFLLRDY</name>
                     <description>DFLL Ready</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DFLLOOB</name>
                     <description>DFLL Out Of Bounds</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DFLLLCKF</name>
                     <description>DFLL Lock Fine</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DFLLLCKC</name>
                     <description>DFLL Lock Coarse</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DFLLRCS</name>
                     <description>DFLL Reference Clock Stopped</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BOD33RDY</name>
                     <description>BOD33 Ready</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BOD33DET</name>
                     <description>BOD33 Detection</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>B33SRDY</name>
                     <description>BOD33 Synchronization Ready</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>INTFLAG</name>
               <description>Interrupt Flag Status and Clear</description>
               <addressOffset>0x8</addressOffset>
               <modifiedWriteValues>oneToClear</modifiedWriteValues>
               <fields>
                  <field>
                     <name>XOSCRDY</name>
                     <description>XOSC Ready</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>XOSC32KRDY</name>
                     <description>XOSC32K Ready</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OSC32KRDY</name>
                     <description>OSC32K Ready</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OSC8MRDY</name>
                     <description>OSC8M Ready</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DFLLRDY</name>
                     <description>DFLL Ready</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DFLLOOB</name>
                     <description>DFLL Out Of Bounds</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DFLLLCKF</name>
                     <description>DFLL Lock Fine</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DFLLLCKC</name>
                     <description>DFLL Lock Coarse</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DFLLRCS</name>
                     <description>DFLL Reference Clock Stopped</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BOD33RDY</name>
                     <description>BOD33 Ready</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BOD33DET</name>
                     <description>BOD33 Detection</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>B33SRDY</name>
                     <description>BOD33 Synchronization Ready</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PCLKSR</name>
               <description>Power and Clocks Status</description>
               <addressOffset>0xC</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>XOSCRDY</name>
                     <description>XOSC Ready</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>XOSC32KRDY</name>
                     <description>XOSC32K Ready</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OSC32KRDY</name>
                     <description>OSC32K Ready</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OSC8MRDY</name>
                     <description>OSC8M Ready</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DFLLRDY</name>
                     <description>DFLL Ready</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DFLLOOB</name>
                     <description>DFLL Out Of Bounds</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DFLLLCKF</name>
                     <description>DFLL Lock Fine</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DFLLLCKC</name>
                     <description>DFLL Lock Coarse</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DFLLRCS</name>
                     <description>DFLL Reference Clock Stopped</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BOD33RDY</name>
                     <description>BOD33 Ready</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BOD33DET</name>
                     <description>BOD33 Detection</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>B33SRDY</name>
                     <description>BOD33 Synchronization Ready</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
